      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      ****************************************************************** 
       01 WS-CITY.
           02 WS-NAME PIC X(50).
           02 WS-POPULATION PIC 9(10).
